# ğŸ“š DataFrame
- 2ì°¨ì› í–‰ë ¬ ë°ì´í„°ë¥¼ í–‰ë ¬ í˜•íƒœê°€ ì•„ë‹Œ í…Œì´ë¸” í˜•íƒœë¡œ ê´€ë¦¬í•  ìˆ˜ ìˆë„ë¡ ì œê³µë˜ëŠ” ìš”ì†Œ
- DataFrame ì»¬ëŸ¼ í•˜ë‚˜ëŠ” í•˜ë‚˜ì˜ Seriesë¡œ êµ¬ì„±ë˜ì–´ ìˆìœ¼ë©° ë‹¤ìˆ˜ì˜ Seriesë“¤ì„ ëª¨ì•„ í•˜ë‚˜ì˜ DataFrameìœ¼ë¡œ ê´€ë¦¬í•œë‹¤.
- DataFrameì€ ë°ì´í„°ì˜ íŠ¹ì„± ë§Œí¼ì˜ Seriesë¡œ êµ¬ì„±ëœë‹¤.

In [1]:
import numpy as np
import pandas as pd

## ğŸ“š ë°ì´í„° í”„ë ˆì„ ìƒì„±
- 2ì°¨ì› ë¦¬ìŠ¤íŠ¸
- ë¦¬ìŠ¤íŠ¸ë¥¼ ê°€ì§€ê³  ìˆëŠ” ë”•ì…”ë„ˆë¦¬
- ë”•ì…”ë„ˆë¦¬ë¥¼ ê°€ì§€ê³  ìˆëŠ” ë¦¬ìŠ¤íŠ¸
- ì™¸ë¶€ íŒŒì¼(csv, ì—‘ì…€, spss ë“±)
- ì›¹ë¬¸ì„œì˜ table tag
- ë°ì´í„° ë² ì´ìŠ¤ì˜ í…Œì´ë¸”
- ê¸°íƒ€ ë“±ë“±

In [4]:
# 2ì°¨ì› ë¦¬ìŠ¤íŠ¸ë¥¼ í†µí•œ ìƒì„±
# ë‚´ë¶€ì˜ ê° ë¦¬ìŠ¤íŠ¸ì˜ ì¸ë±ìŠ¤ê°€ ì¼ì¹˜í•˜ëŠ” ê²ƒ ë¼ë¦¬ ëª¨ì•„ Series ë§Œë“ ë‹¤.
# ë°ì´í„° ê°œìˆ˜ê°€ ë‹¤ë¥´ê²Œ ë˜ì–´ ìˆì„ ê²½ìš°ì—ëŠ” ë¹„ì–´ìˆëŠ” ê³³ì€ ê²°ì¸¡ì¹˜ë¡œ ì±„ì›Œì§„ë‹¤.
list1 = [
    [1, 'ë‚¨ì', 90, 80, 70],
    [2, 'ì—¬ì', 91, 81, 71],
    [3, 'ë‚¨ì', 92, 82, 72],
    [4, 'ì—¬ì', 93, 83, 73],
    [5, 'ë‚¨ì', 94, 84],
    [6, 'ì—¬ì', 95, 85, 75, 65]
]

df1 = pd.DataFrame(list1)

print(df1)
display(df1)

   0   1   2   3     4     5
0  1  ë‚¨ì  90  80  70.0   NaN
1  2  ì—¬ì  91  81  71.0   NaN
2  3  ë‚¨ì  92  82  72.0   NaN
3  4  ì—¬ì  93  83  73.0   NaN
4  5  ë‚¨ì  94  84   NaN   NaN
5  6  ì—¬ì  95  85  75.0  65.0

   0   1   2   3     4     5
0  1  ë‚¨ì  90  80  70.0   NaN
1  2  ì—¬ì  91  81  71.0   NaN
2  3  ë‚¨ì  92  82  72.0   NaN
3  4  ì—¬ì  93  83  73.0   NaN
4  5  ë‚¨ì  94  84   NaN   NaN
5  6  ì—¬ì  95  85  75.0  65.0

In [5]:
# ì»¬ëŸ¼ ì´ë¦„ì— ì‚¬ìš©í•œ ì´ë¦„
column_list = ['ë²ˆí˜¸', 'ì„±ë³„', 'êµ­ì–´', 'ì˜ì–´', 'ìˆ˜í•™', 'ê³¼í•™']
# ì¸ë±ìŠ¤ì— ì‚¬ìš©í•  ì´ë¦„
index_list = ['í•™ìƒ1','í•™ìƒ2','í•™ìƒ3','í•™ìƒ4','í•™ìƒ5','í•™ìƒ6']

In [6]:
# ìƒì„±ë˜ì–´ ìˆëŠ” ë°ì´í„° í”„ë ˆì„ì— ì¸ë±ìŠ¤ì™€ ì»¬ëŸ¼ì´ë¦„ì„ ì„¤ì •í•œë‹¤.
df1.columns = column_list # ì´ë¦„ í¸í•  ê±¸ë¡œ ê³ ì¹  ê²ƒ.
df1.index = index_list
df1

     ë²ˆí˜¸  ì„±ë³„  êµ­ì–´  ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1   1  ë‚¨ì  90  80  70.0   NaN
í•™ìƒ2   2  ì—¬ì  91  81  71.0   NaN
í•™ìƒ3   3  ë‚¨ì  92  82  72.0   NaN
í•™ìƒ4   4  ì—¬ì  93  83  73.0   NaN
í•™ìƒ5   5  ë‚¨ì  94  84   NaN   NaN
í•™ìƒ6   6  ì—¬ì  95  85  75.0  65.0

In [7]:
df2 = pd.DataFrame(list1)
df2

   0   1   2   3     4     5
0  1  ë‚¨ì  90  80  70.0   NaN
1  2  ì—¬ì  91  81  71.0   NaN
2  3  ë‚¨ì  92  82  72.0   NaN
3  4  ì—¬ì  93  83  73.0   NaN
4  5  ë‚¨ì  94  84   NaN   NaN
5  6  ì—¬ì  95  85  75.0  65.0

In [8]:
df2 = pd.DataFrame(list1, columns = column_list)
df2

   ë²ˆí˜¸  ì„±ë³„  êµ­ì–´  ì˜ì–´    ìˆ˜í•™    ê³¼í•™
0   1  ë‚¨ì  90  80  70.0   NaN
1   2  ì—¬ì  91  81  71.0   NaN
2   3  ë‚¨ì  92  82  72.0   NaN
3   4  ì—¬ì  93  83  73.0   NaN
4   5  ë‚¨ì  94  84   NaN   NaN
5   6  ì—¬ì  95  85  75.0  65.0

In [9]:
# ìƒì„±ì‹œ ì¸ë±ìŠ¤ì™€ ì¹¼ëŸ¼ ì´ë¦„ì„ ì§€ì •í•œë‹¤.
df2 = pd.DataFrame(list1, columns = column_list, index = index_list)
df2

     ë²ˆí˜¸  ì„±ë³„  êµ­ì–´  ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1   1  ë‚¨ì  90  80  70.0   NaN
í•™ìƒ2   2  ì—¬ì  91  81  71.0   NaN
í•™ìƒ3   3  ë‚¨ì  92  82  72.0   NaN
í•™ìƒ4   4  ì—¬ì  93  83  73.0   NaN
í•™ìƒ5   5  ë‚¨ì  94  84   NaN   NaN
í•™ìƒ6   6  ì—¬ì  95  85  75.0  65.0

In [11]:
# ë¦¬ìŠ¤íŠ¸ë¥¼ ê°€ì§€ê³  ìˆëŠ” ë”•ì…”ë„ˆë¦¬ë¥¼ í†µí•œ ìƒì„±
# ë”•ì…”ë„ˆë¦¬ì— ì§€ì •í•œ ì´ë¦„ì´ ì»¬ëŸ¼ì˜ ì´ë¦„ìœ¼ë¡œ ê²°ì •ëœë‹¤.
# ë°ì´í„°ì˜ ìˆ˜ê°€ ë‹¤ë¥´ê²Œ ë˜ì–´ìˆìœ¼ë©´ ì˜¤ë¥˜ê°€ ë°œìƒí•˜ê²Œ ëœë‹¤.
# ê°•ì‚¬ë‹˜ì´ ìì£¼ ì“°ëŠ” ë°©ì‹ì„.

data1 = {
    'ë²ˆí˜¸' : [1, 2, 3, 4],
    'ì„±ë³„' : ['ë‚¨ì','ì—¬ì','ë‚¨ì','ì—¬ì'],
    'êµ­ì–´' : [90, 91, 92, 93],
    'ì˜ì–´' : [80, 81, 82, 83],
    'ìˆ˜í•™' : [70, 71, 72, 73],
    #'ê³¼í•™' : [60, 61, 62, 63, 64]
    #'í•œêµ­ì‚¬' : [50, 51, 52]
}

df3 = pd.DataFrame(data1)
df3

   ë²ˆí˜¸  ì„±ë³„  êµ­ì–´  ì˜ì–´  ìˆ˜í•™
0   1  ë‚¨ì  90  80  70
1   2  ì—¬ì  91  81  71
2   3  ë‚¨ì  92  82  72
3   4  ì—¬ì  93  83  73

In [12]:
# ë”•ì…”ë„ˆë¦¬ë¥¼ ê°€ì§€ê³  ìˆëŠ” ë¦¬ìŠ¤íŠ¸
# ê° ë”•ì…”ë„ˆë¦¬ì— ì´ë¦„ì´ ë˜‘ê°™ì€ ê²ƒë“¤ë¼ë¦¬ ëª¨ì—¬ í•˜ë‚˜ì˜ Seriesë¡œ êµ¬ì„±í•œë‹¤.
list3 = [
    {'ë²ˆí˜¸' : 1, 'ì´ë¦„' : 'í™ê¸¸ë™', 'êµ­ì–´' : 100},
    {'ë²ˆí˜¸' : 2, 'ì´ë¦„' : 'ë™ê¸¸ì„œ', 'êµ­ì–´' : 101},
    {'ë²ˆí˜¸' : 3, 'ì´ë¦„' : 'ë°±ê¸¸ë‚¨', 'êµ­ì–´' : 102},
    {'ë²ˆí˜¸' : 4, 'ì´ë¦„' : 'ì„œê¸¸ë¶', 'êµ­ì–´' : 103},
    {'ì´ë¦„' : 'í™©ê¸¸ë™', 'êµ­ì–´' : 199, 'ë²ˆí˜¸' : 5},
    {'ë²ˆí˜¸' : 6, 'ì´ë¦„' : 'ê³ ê¸¸ë™', 'ê·ì–´' : 105},
    {'ë²ˆí˜¸' : 7, 'ì´ë¦„' : 'êµ¬ê¸¸ë™', 'êµ­ì–´' : 106, "ì˜ì–´" : 200}
]
df4 = pd.DataFrame(list3)
df4

   ë²ˆí˜¸   ì´ë¦„     êµ­ì–´     ê·ì–´     ì˜ì–´
0   1  í™ê¸¸ë™  100.0    NaN    NaN
1   2  ë™ê¸¸ì„œ  101.0    NaN    NaN
2   3  ë°±ê¸¸ë‚¨  102.0    NaN    NaN
3   4  ì„œê¸¸ë¶  103.0    NaN    NaN
4   5  í™©ê¸¸ë™  199.0    NaN    NaN
5   6  ê³ ê¸¸ë™    NaN  105.0    NaN
6   7  êµ¬ê¸¸ë™  106.0    NaN  200.0

In [13]:
# csvíŒŒì¼
# ë°ì´í„°ë¥¼ ì‰¼í‘œ(,)ë¡œ êµ¬ë¶„í•œ ë°ì´í„° ì–‘ì‹

# ë°ì´í„° í”„ë ˆì„ ìƒì„±ì‹œ Encoding ì˜¤ë¥˜ê°€ ë°œìƒí•˜ê±°ë‚˜ ìƒì„±ëœ 
#ë°ì´í„° í”„ë ˆì„ì˜ í•œê¸€ ë°ì´í„°ê°€ ê¹¨ì§ˆ ê²½ìš°
# PandasëŠ” ê¸°ë³¸ ì¸ì½”ë”©ì´ UTF-8ë¡œ ì„¤ì •ë˜ì–´ ìˆë‹¤.
#í—ˆë‚˜ í•œêµ­ì—ì„œ ì—‘ì…€ì„ í†µí•´ ì‘ì—…í•œ  csvíŒŒì¼ì€ ì¸ì½”ë”©ì´
# euc-krë¡œ ë˜ì–´ ìˆë‹¤.
# csvíŒŒì¼ì„ í†µí•´ ìƒì„±ì‹œ  encoding ì˜¤ë¥˜ê°€ ë‚˜ê±°ë‚˜ í•œê¸€ì´ ê¹¨ì ¸ì„œ ë‚˜ì˜¤ë©´ 
# encodingì„ euc-krë¡œ ì„¤ì •í•´ì„œ ì‹œë„í•´ë³¸ë‹¤.

# ì²« ë²ˆì§¸ ì¤„ ë°ì´í„°ê°€ ì»¬ëŸ¼ì˜ ì´ë¦„ìœ¼ë¡œ ê²°ì •ëœë‹¤.

df1 = pd.read_csv('data/grade.csv', encoding='euc-kr')
df1

   ì´ë¦„  í•™ë…„  ì„±ë³„   êµ­ì–´    ì˜ì–´    ìˆ˜í•™    ê³¼í•™
0  ì² ìˆ˜   1  ë‚¨ì   98   NaN  88.0  64.0
1  ì˜í¬   2  ì—¬ì   88  90.0  62.0  72.0
2  ë¯¼ìˆ˜   1  ë‚¨ì   92  70.0   NaN   NaN
3  ìˆ˜í˜„   3  ì—¬ì   63  60.0  31.0  70.0
4  í˜¸ì˜   4  ë‚¨ì  120  50.0   NaN  88.0

In [14]:
# **ë§Œì•½ ì²«ë²ˆì§¸ ì¤„ë¶€í„° ë°ì´í„°ë¡œ ë˜ì–´ ìˆë‹¤ë©´...**
# ì›ë³¸ íŒŒì¼ì€ ì†ëŒ€ì§€ ë§ì.
df2 = pd.read_csv('data/grade.csv', header=None, encoding='euc-kr')
df2.columns = ['a1', 'a2', 'a3', 'a4', 'a5', 'a6', 'a7']
df2

   a1  a2  a3   a4   a5   a6   a7
0  ì´ë¦„  í•™ë…„  ì„±ë³„   êµ­ì–´   ì˜ì–´   ìˆ˜í•™   ê³¼í•™
1  ì² ìˆ˜   1  ë‚¨ì   98  NaN   88   64
2  ì˜í¬   2  ì—¬ì   88   90   62   72
3  ë¯¼ìˆ˜   1  ë‚¨ì   92   70  NaN  NaN
4  ìˆ˜í˜„   3  ì—¬ì   63   60   31   70
5  í˜¸ì˜   4  ë‚¨ì  120   50  NaN   88

In [15]:
# ë§Œì•½ 3ë²ˆì§¸ ì¤„ì˜ ë°ì´í„°ë¥¼ ì»¬ëŸ¼ ì´ë¦„ìœ¼ë¡œ ì‚¬ìš©í•˜ê² ë‹¤ë©´...
# ë‹¨, ì»¬ëŸ¼ ì´ë¦„ìœ¼ë¡œ ì§€ì •ëœ ë¡œìš° ìœ„ì— ìˆëŠ” ë°ì´í„°ëŠ” ì‚¬ë¼ì§„ë‹¤. 
df3 = pd.read_csv('data/grade.csv', encoding='euc-kr', header=2)
df3

   ì˜í¬  2  ì—¬ì   88  90    62    72
0  ë¯¼ìˆ˜  1  ë‚¨ì   92  70   NaN   NaN
1  ìˆ˜í˜„  3  ì—¬ì   63  60  31.0  70.0
2  í˜¸ì˜  4  ë‚¨ì  120  50   NaN  88.0

In [17]:
# ì—‘ì…€ íŒŒì¼ì„ í†µí•œ ë°ì´í„° í”„ë ˆì„ ìƒì„±
# sheet_name : ë¬¸ìì—´ì„ ë„£ì„ ê²½ìš° sheetì˜ ì´ë¦„ì´ ë˜ê³  ìˆ«ìë¥¼ ë„£ì„ ê²½ìš°
# sheetì˜ ìˆœì„œ(0ë¶€í„° ì‹œì‘)ì„  ì˜ë¯¸í•œë‹¤.
# ìƒëµ ì‹œ ì²«ë²ˆì§¸ ì‹œíŠ¸ë¡œ ì„¤ì •ëœë‹¤.

#df1 = pd.read_excel('data/grade.xlsx')
#df1 = pd.read_excel('data/grade.xlsx', sheet_name = 0)
df1 = pd.read_excel('data/grade.xlsx', sheet_name = 'grade')
df1

   ì´ë¦„  í•™ë…„  ì„±ë³„   êµ­ì–´    ì˜ì–´    ìˆ˜í•™    ê³¼í•™
0  ì² ìˆ˜   1  ë‚¨ì   98   NaN  88.0  64.0
1  ì˜í¬   2  ì—¬ì   88  90.0  62.0  72.0
2  ë¯¼ìˆ˜   1  ë‚¨ì   92  70.0   NaN   NaN
3  ìˆ˜í˜„   3  ì—¬ì   63  60.0  31.0  70.0
4  í˜¸ì˜   4  ë‚¨ì  120  50.0   NaN  88.0

### ë°ì´í„° í”„ë ˆì„ì˜ ì •ë³´ë¥¼ í™•ì¸í•œë‹¤.
- ë°ì´í„° í”„ë ˆì„ì´ ìƒì„±ë˜ì—ˆë‹¤ë©´ ë°ì´í„°ëŠ” êµ¬ì¡°ì ì¸ ë¬¸ì œëŠ” ì—†ë‹¤.
- ë°ì´í„° í”„ë ˆì„ì˜ ì •ë³´ë¥¼ í™•ì¸í•œë‹¤ëŠ” ì˜ë¯¸ëŠ” ì˜ëª»ëœ ë°ì´í„°ì˜ ì¡´ì¬ ì—¬ë¶€ë¥¼ í™•ì¸í•¨ì´ ëª©ì ì´ë‹¤.
---
- ê²°ì¸¡ì¹˜ : ì¸¡ì •ì´ ê²°ì—¬ëœ ìˆ˜ì¹˜. ì¸¡ì •ë˜ì§€ ì•ŠëŠ” ë°ì´í„°. íŒŒì¼ì—ëŠ” ë¹ˆì¹¸ìœ¼ë¡œ ë˜ì–´ ìˆê³  ë°ì´í„° í”„ë ˆì„ì„ ì¶œë ¥í•˜ë©´ Naë‚˜ NaNìœ¼ë¡œ í‘œì‹œëœë‹¤.
- ì´ìƒì¹˜ : ì •ìƒê°’ì´ ì•„ë‹Œ ë°ì´í„°.
- ëª‡ëª‡ ê²°í•¨ ë°ì´í„° ë³´ì • ê°€ëŠ¥.(1-2 ì •í™•ë„ ì°¨ì´ëŠ” ê° ì¸ˆ(ì¤‘ê°„ê°’, í‰ê· ê°’)ã…‹ã…‹, ì™œê³¡ëœ ë°ì´í„°ë¥¼ ì§‘ì–´ë„£ëŠ” ê²ƒ. ëˆ„êµ¬ë‚˜ ë‚©ë“í•  ìˆ˜ ìˆëŠ” ê°ê´€ì ì¸ ì‚¬ìœ  í•„ìš”.)
- ì œê±°í•˜ê²Œë˜ë©´ ì •ë³´ëŸ‰ì´ ì¤„ì–´ë“œëŠ” ê²ƒ.

In [18]:
df1 = pd.read_csv('data/train.csv')
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
# í–‰ê³¼ ì»¬ëŸ¼ì˜ ìˆ˜ë¥¼ íŒŒì•…í•œë‹¤.
size = df1.shape
print(size)
print(f'í–‰ : {size[0]}')
print(f'ì—´ : {size[1]}')

(891, 12)
í–‰ : 891
ì—´ : 12

In [20]:
# ìƒìœ„ 5ê°œë¥¼ ì¶”ì¶œí•œë‹¤.(í•œ ë²ˆ ì°ì–´ë³¼ ë•Œ or ()ì´ ë§ì€ ìˆœìœ¼ë¡œ ë½‘ì•„ì˜¬ ë•Œ)
display(df1.head())
#í•˜ìœ„ 5ê°œë¥¼ ì¶”ì¶œí•œë‹¤.
display(df1.tail())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [17]:
# ìƒìœ„ nê°œ
display(df1.head(3))
# í•˜ìœ„ nê°œ
display(df1.tail(3))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [18]:
# ì»¬ëŸ¼ì˜ ì´ë¦„ì„ ê°€ì ¸ì˜¨ë‹¤. # ë°˜ë³µë¬¸ ì´ìš© ê°€ëŠ¥.
a1 = df1.columns
a1

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [21]:
#  ì¸ë±ìŠ¤ì˜ ì´ë¦„ì„ ê°€ì ¸ì˜¨ë‹¤.
a2 = df1.index
print(list(a2))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870, 871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883, 884, 885, 886, 887, 888, 889, 890]

In [22]:
# ë°ì´í„° í”„ë ˆì„ì˜ ìš”ì•½ ì •ë³´
# 891 entries : rowê°€ 891ê°œ ìˆë‹¤ëŠ” ëœ»ì´ë‹¤.
# total 12 columns : ì»¬ëŸ¼ì´ 12ê°œ ìˆë‹¤ëŠ” ëœ»ì´ë‹¤.
# Column : ë°ì´í„° í”„ë ˆì„ì„ êµ¬ì„±í•˜ëŠ” ì»¬ëŸ¼ì˜ ì´ë¦„.
# Non-Null Count : ê²°ì¸¡ì¹˜ê°€ ì•„ë‹Œ ë°ì´í„°ì˜ ìˆ˜.
# **Dtype** : ì»¬ëŸ¼ì— ì €ì¥ë˜ì–´ ìˆëŠ” ê°’ì˜ íƒ€ì….
# int(ì •ìˆ˜), float(ì‹¤ìˆ˜), **object(ë¬¸ì)**, datetime(ì‹œê°„)ì´
#ë“¤ì–´ê°ˆ ìˆ˜ ìˆë‹¤.


df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
# ê° ì»¬ëŸ¼ì˜ ê²°ì¸¡ì¹˜ ê°œìˆ˜ë¥¼ íŒŒì•…
# isna : ê° ì»¬ëŸ¼ì˜ ë°ì´í„°ë¥¼ ê²°ì¸¡ì¹˜ëŠ” True. ê²°ì¸¡ì¹˜ê°€ ì•„ë‹Œ ê²ƒì€
#Falseë¡œ ëœ ìƒˆë¡œìš´ ë°ì´í„° í”„ë ˆì„ì„ ìƒì„±í•œë‹¤.
# sum : ê° ì»¬ëŸ¼ë³„ ì´í•©ì„ êµ¬í•œë‹¤. ë§Œì•½ Trueë‚˜ Falseë¡œ êµ¬ì„±ë˜ì–´ ìˆë‹¤ë©´
#Trueë¥¼ 1, Falseë¥¼ 0ìœ¼ë¡œ ì·¨ê¸‰í•˜ì—¬ í•©ì‚°í•œë‹¤.

df1.isna().sum() # ê²°ì¸¡ì¹˜ê°€ ëª‡ ê°œì¸ì§€ ì…€ ìˆ˜ ìˆë‹¤.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### ë°ì´í„°ì˜ ì¢…ë¥˜
- ë ˆì´ë¸”í˜•, ì¹´í…Œê³ ë¦¬í˜• : ê°’ì˜ ì¢…ë¥˜ê°€ ì •í•´ì ¸ ìˆëŠ” ê°’(í˜ˆì•¡í˜•, ì„±ë³„, ì§€í•˜ì²  í˜¸ì„  ë“±ë“±) => ì–´ë– í•œ ì¢…ë¥˜ì˜ ê°’ ì €ì¥ë˜ì–´ ìˆëŠ”ì§€ í™•ì¸.
- ë²”ìœ„í˜• ë°ì´í„° : ê°’ì˜ ë²”ìœ„(ìµœì†Œì™€ ìµœëŒ€ê°€ ì¡´ì¬í•˜ëŠ” ê°’(ë‚˜ì´, í‚¤, ëª¸ë¬´ê²Œ ë“±ë“±)) => ìµœì†Œì™€ ìµœëŒ“ê°’ì„ í™•ì¸. ì´ìƒì¹˜ ì°¾ëŠ” ê²ƒ.
- **ë°ì´í„°ì˜ ì¢…ë¥˜ì— ë”°ë¼ í†µê³„ê°’ì„ í•´ì„í•´ì•¼ í•œë‹¤. ì•Œì•„ë´ì•¼í•˜ëŠ” ë°ì´í„°ê°€ ì¢…ë¥˜ì— ë”°ë¼ ë‹¤ë¥´ë‹¤!**

In [24]:
# ìš”ì•½ í†µê³„ ì •ë³´
# ë°ì´í„° í”„ë ˆì„ ë‚´ì˜ ìˆ«ì íƒ€ì… ì»¬ëŸ¼ë“¤ë§Œ ëª¨ì•„ ìš”ì•½ í†µê³„ ì •ë³´ë¥¼ ì œê³µí•œë‹¤.
# ì˜ëª»ëœ ë°ì´í„°ê°€ ìˆëŠ”ì§€ í™•ì¸í•˜ê¸° ìœ„í•´ ì”€.
# Survivedì •ë³´ì˜ ê²½ìš° ì˜ë¯¸ê°€ ìˆë‚˜? Categoryí˜• ë°ì´í„°.

df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### (ì›í•˜ëŠ” ë°ì´í„°ë¥¼ ê°€ì ¸ì˜¨ë‹¤.)

In [25]:
# ì»¬ëŸ¼ì„ ê°€ì ¸ì˜¨ë‹¤. (Seriesë¡œ ë°˜í™˜ëœë‹¤)
df1['Survived']

# listë‚˜ ndarrayëŠ” 2ì°¨ì›ì¼ ë•Œ ì²«ë²ˆì§¸ []ëŠ” í–‰ìœ¼ë¡œ ì¸ì‹
#ê·¸ëŸ¬ë‚˜ dfì—ì„œëŠ” ì—´ë¡œ ì¸ì‹.

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [26]:
# ì—¬ëŸ¬ ì»¬ëŸ¼ë“¤ì„ ê°€ì ¸ì˜¨ë‹¤. 
df1[['Survived' , 'Name', 'Cabin', 'Embarked']]

,Survived,Name,Cabin,Embarked
0,0,"Braund, Mr. Owen Harris",NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",C85,C
2,1,"Heikkinen, Miss. Laina",NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",C123,S
4,0,"Allen, Mr. William Henry",NaN,S
...,...,...,...,...
886,0,"Montvila, Rev. Juozas",NaN,S
887,1,"Graham, Miss. Margaret Edith",B42,S
888,0,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,S
889,1,"Behr, Mr. Karl Howell",C148,C
890,0,"Dooley, Mr. Patrick",NaN,Q

---
> ì¸ë±ìŠ¤ ì¶”ê°€í•´ë³´ê³ , locí™•ì¸ í›„ ì¸ë±ìŠ¤ ì‚­ì œí•´ë³´ê¸°

In [62]:
df2=df1.copy().head()

In [63]:
df2.index = ['ê°‘','ì„','ë³‘','ì •','ë¬´']

In [67]:
df2.loc[['ê°‘','ì •']]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
ê°‘,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
ì •,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S

In [60]:
df2.reset_index(drop=True, inplace=True)

In [61]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

---

In [68]:
df1.loc[0]
# ì¸ë±ìŠ¤ 0ì˜ í–‰ì— ìˆëŠ” ëª¨ë“  ê²°ê³¼ê°’ì„ ê°€ì ¸ì˜¬ ìˆ˜ ìˆë‹¤.

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [69]:
# ì¸ë±ìŠ¤ê°€ 0 ~ 7ê¹Œì§€ (7 - 1ì•„ë‹˜. ì¸ë±ìŠ¤ë¥¼ ê°€ì ¸ì˜¤ëŠ” ê²ƒ.)
df1.loc[0:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [70]:
# ì¸ë±ìŠ¤ ìˆœì„œ (2ë²ˆì§¸ êº¼)
df1.iloc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [71]:
# ë²”ìœ„í˜• ë°ì´í„°ì— ëŒ€í•œ ìš”ì•½ í†µê³„ ì •ë³´.
# ì´ìƒì¹˜ í™•ì¸ ê°€ëŠ¥
# count : ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•œ ë°ì´í„°ì˜ ê°œìˆ˜
# mean : ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•œ í‰ê· 
# std : ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•œ í‘œì¤€í¸ì°¨
# **min** : ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•œ ìµœì†Œê°’
# 25% : ìµœëŒ€, ìµœì†Œ ë²”ìœ„ì•ˆì— 25% ìœ„ì¹˜ì˜ ê°’(ì¡´ì¬í•˜ì§€ ì•Šì„ ìˆ˜ ìˆë‹¤.)
# 50% : ìµœëŒ€, ìµœì†Œ ë²”ìœ„ì•ˆì— 50% ìœ„ì¹˜ì˜ ê°’(ì¡´ì¬í•˜ì§€ ì•Šì„ ìˆ˜ ìˆë‹¤.)
# 75% : ìµœëŒ€, ìµœì†Œ ë²”ìœ„ì•ˆì— 75% ìœ„ì¹˜ì˜ ê°’(ì¡´ì¬í•˜ì§€ ì•Šì„ ìˆ˜ ìˆë‹¤.)
# **max** : ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•œ ìµœëŒ€ê°’

#minê³¼ maxë¥¼ í†µí•´ ì •ìƒ ë²”ìœ„ì— ë²—ì–´ë‚˜ëŠ” ë°ì´í„°ê°€ ìˆëŠ”ì§€ í™•ì¸í•œë‹¤.
#(ê·¹ë‹¨ì¹˜ ì¡´ì¬ ì—¬ë¶€ë„ **í™•ì¸**í•´ì•¼ í•¨.)

df1[['Age', 'Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [75]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [92]:
df1[['Name','Sex','Ticket','Cabin','Embarked']].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [82]:
df1[['Cabin','Embarked']].describe()

          Cabin Embarked
count       204      889
unique      147        3
top     B96 B98        S
freq          4      644

In [ ]:
df1['Pclass'].describe()

In [72]:
# ì¹´í…Œê³ ë¦¬(ë ˆì´ë¸”)í˜• ë°ì´í„° (.describeí•¨ìˆ˜ë„ ì¢‹ì§€ë§Œ..)
# count : ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•œ ë°ì´í„°ì˜ ê°œìˆ˜
# unique : ê°’ì˜ ì¢…ë¥˜
# top : ê°€ì¥ ë§ì´ ì €ì¥ë˜ì–´ ìˆëŠ” ê°’
# freq : ê°€ì¥ ë§ì´ ì €ì¥ë˜ì–´ ìˆëŠ” ê°’ì´ ëª‡ ê°œ ì €ì¥ë˜ì–´ ìˆëŠ”ì§€.
##ìš”ì•½ í†µê³„ ì •ë³´ëŠ” ìˆ«ì ì»¬ëŸ¼ì¸ ê²½ìš°ì—ëŠ” ë²”ìœ„í˜• ë°ì´í„°ë¡œ ì·¨ê¸‰í•´ 
##ë³´ì—¬ì£¼ê²Œ ë˜ê³  ë¬¸ìì—´ì´ë¼ê³  í•˜ë”ë¼ë„ ì–´ë– í•œ ë°ì´í„°ê°€ ì €ì¥ë˜ì–´ ìˆëŠ”ì§€
##ì•Œ ìˆ˜ ì—†ê¸° ë•Œë¬¸ì— ì´ìƒì¹˜ ì¡´ì¬ ì—¬ë¶€ë¥¼ í™•ì¸í•˜ê¸°ê°€ ì–´ë µë‹¤.

#df1['Pclass']
df1['Embarked'].describe() # ì´ê±¸ë¡œ ì˜ˆìƒì¹˜ ì°¾ëŠ” ê²ƒ ì–´ë ¤ìš¸ ìˆ˜ ìˆìŒ.
#ë“±ë¡ìì˜ ì‹¤ìˆ˜ë¡œ. ex) count - í˜ˆì•¡í˜•

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [73]:
# value_counts : Series ë‚´ì— ì–´ë– í•œ ê°’ì´ ì €ì¥ë˜ì–´ ìˆëŠ”ì§€
#ê²°ê³¼ë¥¼ ë°˜í™˜í•´ì¤€ë‹¤.
display(df1['Pclass'].value_counts())
display(df1['Embarked'].value_counts()) 
# 3gê°€ ê°€ì§€ê³  ìˆëŠ” í•¨ìˆ˜.
#ê²°ê³¼ì˜ ì¸ë±ìŠ¤(Q) í•´ë‹¹ ê°’ì˜ ì¢…ë¥˜ê°€ ë¨.
#ê°’ì´ ë§ì„ ë•Œ ì¤‘ê°„ ìƒëµë˜ê¸° ë•Œë¬¸ì— ì•Œê¸° ì–´ë µë‹¤. => + .index
display(df1['Pclass'].value_counts().index)
display(df1['Embarked'].value_counts().index) 
#ë²”ìœ„í˜• : ìµœì†Œ, ìµœëŒ“ê°’ í™•ì¸.
#ì¹´í…Œê³ ë¦¬í˜• : ì–´ë–¤ ì¢…ë¥˜ ë°ì´í„°ê°€ ìˆëŠ”ì§€ í™•ì¸. => ì´ìƒì¹˜ í™•ì¸.

3    491
1    216
2    184
Name: Pclass, dtype: int64

S    644
C    168
Q     77
Name: Embarked, dtype: int64

Int64Index([3, 1, 2], dtype='int64')

Index(['S', 'C', 'Q'], dtype='object')

### íŠ¹ì • ìœ„ì¹˜ì˜ ê°’ì— ì ‘ê·¼í•œë‹¤.

In [95]:
df1 = pd.read_csv('data/grade.csv', encoding='euc-kr')
df1.index = ['í•™ìƒ1', 'í•™ìƒ2', 'í•™ìƒ3', 'í•™ìƒ4', 'í•™ìƒ5']
df1
# columnsì€ ë…ë¦½ë³€ìˆ˜(ìˆœì„œê°€ ìˆëŠ” ê²ƒì´ ì•„ë‹˜). ì§ì ‘ì ì¸ ìƒê´€ê´€ê³„ëŠ” ì—†ë‹¤ê³  ë´ì•¼ í•¨(ì•…ì˜í–¥ -> ë…¸ì´ì¦ˆ). -> ìˆë‹¤ë©´ ì¢…ì†ë³€ìˆ˜.
#ë¨¸ì‹ ëŸ¬ë‹ì—ì„œ ìµœëŒ€í•œ ë…ë¦½ë³€ìˆ˜ì¸ ê²ƒì„ ìœ ì§€í•˜ëŠ”ê²Œ ì¤‘ìš”.
# í–‰ì€ ìˆœì„œì— ëŒ€í•œ ê°œë… ì¡´ì¬. ì—´ì€ ì—†ë‹¤.

     ì´ë¦„  í•™ë…„  ì„±ë³„   êµ­ì–´    ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1  ì² ìˆ˜   1  ë‚¨ì   98   NaN  88.0  64.0
í•™ìƒ2  ì˜í¬   2  ì—¬ì   88  90.0  62.0  72.0
í•™ìƒ3  ë¯¼ìˆ˜   1  ë‚¨ì   92  70.0   NaN   NaN
í•™ìƒ4  ìˆ˜í˜„   3  ì—¬ì   63  60.0  31.0  70.0
í•™ìƒ5  í˜¸ì˜   4  ë‚¨ì  120  50.0   NaN  88.0

In [96]:
# íŠ¹ì • ì»¬ëŸ¼(Series)ë¥¼ ê°€ì ¸ì˜¨ë‹¤.
s1 = df1['êµ­ì–´']
s1

í•™ìƒ1     98
í•™ìƒ2     88
í•™ìƒ3     92
í•™ìƒ4     63
í•™ìƒ5    120
Name: êµ­ì–´, dtype: int64

In [97]:
# íŠ¹ì • í–‰ì„ ì¶”ì¶œí•œë‹¤(index)
r1 = df1.loc['í•™ìƒ3']
r1

ì´ë¦„      ë¯¼ìˆ˜
í•™ë…„       1
ì„±ë³„      ë‚¨ì
êµ­ì–´      92
ì˜ì–´    70.0
ìˆ˜í•™     NaN
ê³¼í•™     NaN
Name: í•™ìƒ3, dtype: object

In [98]:
# íŠ¹ì • í–‰ì„ ê°€ì ¸ì˜¨ë‹¤(ìˆœì„œ. 0ë¶€í„° ì‹œì‘)
r2 = df1.iloc[2]
r2

ì´ë¦„      ë¯¼ìˆ˜
í•™ë…„       1
ì„±ë³„      ë‚¨ì
êµ­ì–´      92
ì˜ì–´    70.0
ìˆ˜í•™     NaN
ê³¼í•™     NaN
Name: í•™ìƒ3, dtype: object

In [99]:
df1

     ì´ë¦„  í•™ë…„  ì„±ë³„   êµ­ì–´    ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1  ì² ìˆ˜   1  ë‚¨ì   98   NaN  88.0  64.0
í•™ìƒ2  ì˜í¬   2  ì—¬ì   88  90.0  62.0  72.0
í•™ìƒ3  ë¯¼ìˆ˜   1  ë‚¨ì   92  70.0   NaN   NaN
í•™ìƒ4  ìˆ˜í˜„   3  ì—¬ì   63  60.0  31.0  70.0
í•™ìƒ5  í˜¸ì˜   4  ë‚¨ì  120  50.0   NaN  88.0

In [100]:
# ì›í•˜ëŠ” ìœ„ì¹˜ì˜ ê°’ì„ ê°€ì ¸ì˜¨ë‹¤.
v1 = df1['êµ­ì–´']['í•™ìƒ3']
v1
#êµ­ì–´ë¼ëŠ” ì—´ì— í•™ìƒ3ì´ë¼ëŠ” í–‰. ì—´ -> í–‰ ìˆœì„œ.

92

-  v2 = df1['êµ­ì–´','í•™ìƒ3'] # ndarrayì—ì„  ê°€ëŠ¥í–ˆìŒ. ì—´ í–‰ì´ê¸° ë•Œë¬¸ì— í—ˆìš©í•˜ì§€ ì•ŠìŒ.
- v2
- KeyError: ('êµ­ì–´', 'í•™ìƒ3')

In [101]:
# í–‰, ì—´ ì ‘ê·¼
v3 = df1.loc['í•™ìƒ3']['êµ­ì–´']
v3

92

In [102]:
v4 = df1.loc['í•™ìƒ3', 'êµ­ì–´'] # ì´ê±° ì™œ ë‚˜ì˜¤ì§€?
v4

92

In [103]:
# ìˆœì„œ( 3ë²ˆì§¸ í–‰ì— 2ë²ˆì§¸ ì—´)
v5 = df1.iloc[2][3]
v5

92

In [106]:
v6 = df1.iloc[2, 3] # í–‰ì—´ë¡œ ì ‘ê·¼ ì‹œ ê°€ëŠ¥.
v6

1000

In [107]:
# ì—´ í–‰ ì ‘ê·¼ ë°©ì‹ìœ¼ë¡œ ê°’ì„ ì„¤ì •í•œë‹¤.
df1['êµ­ì–´']['í•™ìƒ3'] = 1000
df1
# ìƒˆë¡œ ë³µì œí•œ 'êµ­ì–´'í”„ë ˆì„ì„ ë³µì œí•´ ê°’ì„ ë§Œë“¦.
# ì›ë³¸ ë°ì´í„°ì—ì„œ ê°’ì„ ì¶”ì¶œí•´ì„œ ê°’ì´ ë°”ë€œ.

<ipython-input-107-88ec338a69cd>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['êµ­ì–´']['í•™ìƒ3'] = 1000

     ì´ë¦„  í•™ë…„  ì„±ë³„    êµ­ì–´    ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1  ì² ìˆ˜   1  ë‚¨ì    98   NaN  88.0  64.0
í•™ìƒ2  ì˜í¬   2  ì—¬ì    88  90.0  62.0  72.0
í•™ìƒ3  ë¯¼ìˆ˜   1  ë‚¨ì  1000  70.0   NaN   NaN
í•™ìƒ4  ìˆ˜í˜„   3  ì—¬ì    63  60.0  31.0  70.0
í•™ìƒ5  í˜¸ì˜   4  ë‚¨ì   120  50.0   NaN  88.0

In [109]:
# í–‰ ì—´ ì ‘ê·¼ (index)
df1.loc['í•™ìƒ3']['ì˜ì–´'] = 2000
df1
# ê°’ì´ ì•ˆë°”ë€œ.???? ì ‘ê·¼í•˜ëŠ” ê²ƒ.

C:\Users\medici\anaconda3\lib\site-packages\pandas\core\series.py:1056: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cacher_needs_updating = self._check_is_chained_assignment_possible()

     ì´ë¦„  í•™ë…„  ì„±ë³„    êµ­ì–´    ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1  ì² ìˆ˜   1  ë‚¨ì    98   NaN  88.0  64.0
í•™ìƒ2  ì˜í¬   2  ì—¬ì    88  90.0  62.0  72.0
í•™ìƒ3  ë¯¼ìˆ˜   1  ë‚¨ì  1000  70.0   NaN   NaN
í•™ìƒ4  ìˆ˜í˜„   3  ì—¬ì    63  60.0  31.0  70.0
í•™ìƒ5  í˜¸ì˜   4  ë‚¨ì   120  50.0   NaN  88.0

In [110]:
# ì´ì „ì— ë³¸ í‘œê¸° ê¸°ë²•ì€ ê·¸ê²ƒì— í•´ë‹¹í•˜ëŠ” ê²ƒë“¤ì„ ì¶”ì¶œí•˜ì—¬
##ìƒˆë¡œìš´ ë°ì´í„° í”„ë ˆì„ì„ ìƒì„±í•´ì„œ ë°˜í™˜í•œë‹¤.(ë°œì·Œ)
# ì•„ë˜ì˜ í‘œê¸° ê¸°ë²•ì€ í•´ë‹¹ ë°ì´í„° í”„ë ˆì„ì— ì§ì ‘ ì ‘ê·¼ì„ í•œë‹¤.
# ê°•ì‚¬ë‹˜ì€ ë¬´ì¡°ê±´ ì‰¼í‘œ ì°ëŠ” ê±¸ë¡œ ì”€.
# ë°ì´í„° ì§‘ì–´ë„£ëŠ” ê±´ ë‹¤ë¦„. í–‰ ì—´ êµ¬ì¡°ë¡œ ì ‘ê·¼í•  ë•Œë§Œ.
df1.loc['í•™ìƒ3', 'ì˜ì–´'] = 2000
df1

     ì´ë¦„  í•™ë…„  ì„±ë³„    êµ­ì–´      ì˜ì–´    ìˆ˜í•™    ê³¼í•™
í•™ìƒ1  ì² ìˆ˜   1  ë‚¨ì    98     NaN  88.0  64.0
í•™ìƒ2  ì˜í¬   2  ì—¬ì    88    90.0  62.0  72.0
í•™ìƒ3  ë¯¼ìˆ˜   1  ë‚¨ì  1000  2000.0   NaN   NaN
í•™ìƒ4  ìˆ˜í˜„   3  ì—¬ì    63    60.0  31.0  70.0
í•™ìƒ5  í˜¸ì˜   4  ë‚¨ì   120    50.0   NaN  88.0

In [44]:
df1.iloc[2, 5] = 3000
df1

# í–‰ ì—´ ì ‘ê·¼ ì‹œì—ëŠ” ì´ê²Œ ë‚˜ì„ë“¯.
# ë‚´ì¼ í†µê³„, ê°ì¢… ì „ì²˜ë¦¬

     ì´ë¦„  í•™ë…„  ì„±ë³„    êµ­ì–´      ì˜ì–´      ìˆ˜í•™    ê³¼í•™
í•™ìƒ1  ì² ìˆ˜   1  ë‚¨ì    98     NaN    88.0  64.0
í•™ìƒ2  ì˜í¬   2  ì—¬ì    88    90.0    62.0  72.0
í•™ìƒ3  ë¯¼ìˆ˜   1  ë‚¨ì  1000  2000.0  3000.0   NaN
í•™ìƒ4  ìˆ˜í˜„   3  ì—¬ì    63    60.0    31.0  70.0
í•™ìƒ5  í˜¸ì˜   4  ë‚¨ì   120    50.0     NaN  88.0